{
  "0010": {
    "isJustified": "never morally justified",
    "isEqual": "should be",
    "analysis": "Your view that animal life is as important as human life is evident from your responses to the first and second scenarios. Choosing the same options for both scenarios indicates that you hold both lives to the same level of regard, and hence should be treated the same. You also think that humans are not the superior beings; and thus, do not have the deciding rights over the life of other beings. That is why you would wait for the animal to have a natural death. Furthermore, your response to the third scenario clearly shows that even with limited resources and a number of other beings are suffering as well, you are still opposed to expediting the death."
  },
  
  "0011": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should be",
    "analysis": "Your view that animal life is as important as human life is evident from your responses to the first and second scenarios. Choosing the same options for both scenarios indicates that you hold both lives to the same level of regard, and hence should be treated the same. You also think that humans are not the superior beings; and thus, do not have the deciding rights over the life of other beings. That is why you would wait for the animal to have a natural death. However, your response to the third scenario shows that expediting death is morally permissible only if it is for the greater good of other beings."
  },

  "0000": {
    "isJustified": "never morally justified",
    "isEqual": "should be",
    "analysis": "Your view that animal life is as important as human life is evident from your responses to the first and second scenarios. Choosing the same options for both scenarios indicates that you hold both lives to the same level of regard, and hence should be treated the same. However, despite thinking that humans are the superior beings; and thus, have the deciding rights over the life of other beings, you do not wish to exercise those rights and wait for natural death. Furthermore, your response to the third scenario clearly shows that even with limited resources and a number of other beings are suffering as well, you are still opposed to expediting death."
  },

  "0001": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should be",
    "analysis": "Your view that animal life is as important as human life is evident from your responses to the first and second scenarios. Choosing the same options for both scenarios indicates that you hold both lives to the same level of regard, and hence should be treated the same. However, despite thinking that humans are the superior beings; and thus, have the deciding rights over the life of other beings, you do not wish to exercise those rights and wait for natural death. However, your response to the third scenario shows that expediting death is morally permissible only if it is for the greater good of other beings."
  },
  
  "1110": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should be",
    "analysis": "Your view that animal life is as important as human life is evident from your responses to the first and second scenarios. Choosing the same options for both scenarios indicates that you hold both lives to the same level of regard, and hence should be treated the same. You also think that humans are not the superior beings; and thus, do not have the deciding rights over the life of other beings. However, you have made the decision to expedite death on the basis that there is little to no hope for cure. What is more peculiar is that your response to the third scenario clearly shows that even with limited resources and a number of other beings are suffering as well, you are opposed to expediting the death. There are inconsistencies and a sense of confusion in your responses."
  },

  "1111": {
    "isJustified": "always morally justified",
    "isEqual": "should be",
    "analysis": "Your view that animal life is as important as human life is evident from your responses to the first and second scenarios. Choosing the same options for both scenarios indicates that you hold both lives to the same level of regard, and hence should be treated the same. You also think that humans are not the superior beings; and thus, do not have the deciding rights over the life of other beings. Given that stance, it is peculiar that you have made the decision to expedite death on the basis that there is little to no hope for cure. Furthermore, your response to the third scenario clearly shows that with limited resources and a number of other beings suffering as well, it makes expediting death morally permissible."
  },
  
  "1100": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should be",
    "analysis": ""
  },
  
  "1101": {
    "isJustified": "always morally justified",
    "isEqual": "should be",
    "analysis": ""
  },

  "0100": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should not be",
    "analysis": ""
  },

  "0101": {
    "isJustified": "always morally justified",
    "isEqual": "should not be",
    "analysis": ""
  },
  
  "0110": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should not be",
    "analysis": ""
  },

  "0111": {
    "isJustified": "always morally justified",
    "isEqual": "should not be",
    "analysis": ""
  },

  "1000": {
    "isJustified": "never morally justified",
    "isEqual": "should not be",
    "analysis": ""
  },

  "1001": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should not be",
    "analysis": ""
  },
  
  "1010": {
    "isJustified": "never morally justified",
    "isEqual": "should not be",
    "analysis": ""
  },

  "1011": {
    "isJustified": "morally justified to a certain extent",
    "isEqual": "should not be",
    "analysis": ""
  }
}